{
	"_meta": {
		"sources": [
			{
				"json": "YesterdayClassPassives",
				"abbreviation": "YCPas",
				"full": "Yesterday's Class Passives and Feat Tiering",
				"authors": [
					"Yesterday"
				],
				"version": "2.3.0",
				"url": "https://github.com/yesterdaydnd/ClassPassives/",
				"targetSchema": "2.3.0"
			}
		],
		"optionalFeatureTypes": {
			"MV:P": "Maneuver, Pugilist Stunts",
			"FS:Pu": "Fighting Style, Pugilist",
			"CP": "Class Passive"
		},
		"dateAdded": 0,
		"dateLastModified": 0
	},
	"optionalfeature": [
		{
			"name": "Attuning Catalyst",
			"prerequisite": [
				{
					"level": {
						"level": 2,
						"class": {
							"name": "Artificer"
						}
					}
				}
			],
			"entries": [
				"You modify your spellcasting focus to help you with your attunements. You gain one additional attunement slot."
			],
			"source": "YesterdayClassPassives",
			"featureType": [
				"CP"
			]
		},
		{
			"name": "Catalysed Overcast",
			"prerequisite": [
				{
					"level": {
						"level": 6,
						"class": {
							"name": "Artificer"
						}
					}
				}
			],
			"entries": [
				"You can create a special type of catalyst that allows you to cast spells beyond you comprehension. This catalyst can be your spellcasting focus. When you take this feature at 6th level, choose a 3rd level spell from the Wizard spell list. You can cast this spell once or upcast a spell you know at 3rd level. After you use this feature, you gain one level of exhaustion and can't do it again until you finish a long rest. At 10th level, you can swap the spell you chose for a 4th level spell from the wizard list, or upcast a spell once at 4th level. At 14th level, you can swap it for a 5th level spell or upcast a spell once at 5th level. At 18th level, you can swap it for a 6th level spell or upcast a spell once at 6th level."
			],
			"source": "YesterdayClassPassives",
			"featureType": [
				"CP"
			]
		},
		{
			"name": "Hasty Reconstruction",
			"prerequisite": [
				{
					"level": {
						"level": 2,
						"class": {
							"name": "Artificer"
						}
					}
				}
			],
			"entries": [
				"You learn one additional Infusion Known. Once per short rest, as an action, you can immediately end one of your active infusions and infuse another item with one infusion you know."
			],
			"source": "YesterdayClassPassives",
			"featureType": [
				"CP"
			]
		},
		{
			"name": "Homunculus Swarm",
			"prerequisite": [
				{
					"level": {
						"level": 2,
						"class": {
							"name": "Artificer"
						}
					}
				},
				{
					"other": "Homunculus Servant Infusion or Steel Defender"
				}
			],
			"entries": [
				"You can upgrade your companion (Homunculus or Steel Defender) to a swarm of tiny-sized homunculi. The swarm has a 0ft melee range and can occupy a creatures' space. It can move through a space as narrow as 1 inch wide without squeezing. Its damage is 2d4 + proficiency bonus when the swarm is over half its maximum hit points and goes down to 1d4 + proficiency bonus when its below it. As a bonus action, you can order the swarm to split into two. When you do so, the swarm divides into two creatures, with half your companion's maximum and current hit points and their attacks deal 1d4 + proficiency bonus. Whenever you order your Homunculus to perform an action, you can give a different order to each half of the swarm."
			],
			"source": "YesterdayClassPassives",
			"featureType": [
				"CP"
			]
		},
		{
			"name": "Infused Feature",
			"prerequisite": [
				{
					"level": {
						"level": 2,
						"class": {
							"name": "Artificer"
						}
					}
				}
			],
			"entries": [
				"You can choose to learn a Feat from the Intermediary or Lesser Feats list. This feat is a Class Feat for you, and you may not take another Intermediary or Lesser Feat through Class Passives even if you get the option later (such as with multiclassing)."
			],
			"source": "YesterdayClassPassives",
			"featureType": [
				"CP"
			]
		},
		{
			"name": "Wait... I Have an Idea",
			"prerequisite": [
				{
					"level": {
						"level": 2,
						"class": {
							"name": "Artificer"
						}
					}
				}
			],
			"entries": [
				"You gain the ability to make a makeshift prototype of an item bearing any infusion from the artificer infusions list, (including Replicate Magic Item). This item does not count towards your number of active infusions. You must spend 1 minute making the item to successfully create it, or you can make a DC 15 check using your artisan's tool to make it during an action. This item lasts for one use if it has any charges or spellcasting related to it, or 10 minutes. You needn't know the infusion used or have knowledge of the magic item beforehand, but you cannot improvise an item or infusion you already have as an active infusion. Once you successfully use this feature, you can't use it again until you finish a long rest."
			],
			"source": "YesterdayClassPassives",
			"featureType": [
				"CP"
			]
		}
	]
}
